# BadClassificationLevel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..KeyBasedTreeEntryFailures..::..BadClassificationLevel Property
BuiltInFailures..::..KeyBasedTreeEntryFailures Class See Also
---
Level [Level] of Classification [Code] is not an integer from 1 to 5.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadClassificationLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadClassificationLevel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadClassificationLevel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace